ReverseCompositeApp/ReverseCompositeApp/src/jbiasa/ReverseCompositeApp.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="ReverseCompositeApp"
             xmlns:tns="ReverseCompositeApp" xmlns:ns="http://reversepojo.soa.davidsalter.com/ReversePoJo/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://reversepojo.soa.davidsalter.com/ReversePoJo/" location="../jbiServiceUnits/ReversePoJo/com/davidsalter/soa/reversepojo/ReversePoJo.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:ReversePoJoInterface">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ReversePoJoOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="ReverseCompositeApp"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="ReverseCompositeApp"/>
            </output>
        </operation>
    </binding>
    <service name="ReverseCompositeAppService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/ReverseCompositeAppService1/casaPort1"/>
        </port>
    </service>
</definitions>

