ReverseCompositeApp/ReverseCompositeApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rev="ReverseCompositeApp">
  <soapenv:Body>
    <rev:ReversePoJoOperation>
      <part1>abcdefg</part1>
    </rev:ReversePoJoOperation>
  </soapenv:Body>
</soapenv:Envelope>